package JavaErrorExceptions;

/**
 * Created by mirzaf4eg in nov 2020
 * Course EPAM: Junior Test Automation Engineer in Java
 * ELearn: Java. Error & Exceptions
 * Main Task
 * В университете есть несколько факультетов, в которых учатся студенты, объединенные в группы.
 * У каждого студента есть несколько учебных предметов по которым он получает оценки.
 * Необходимо реализовать иерархию студентов, групп и факультетов.
 * Посчитать:
 *     - Cредний балл по всем предметам студента
 *     - Cредний балл по конкретному предмету в конкретной группе и на конкретном факультете
 *     - Cредний балл по предмету для всего университета
 * Релизовать следующие исключения:
 *     - Оценка ниже 0 или выше 10
 *     - Отсутсвие предметов у студента (должен быть хотя бы один)
 *     - Отсутствие студентов в группе
 *     - Отсутствие групп на факультете
 *     - Отсутствие факультетов в университете
 */

public class Main
{
    public static void main( String[] args )
    {
        System.out.println( "Hello World!" );
    }
}
